XML/Public/AMSQ01-FK/request/body_AMSQ01-FK.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:out="http://outsystem.ats.com.cn">
   <soapenv:Header/>
   <soapenv:Body>
      <out:outSystemWS>
         <out:in0>
<![CDATA[
<MBS>
  <pub>
    <SRCOUTSYSTEMCODE>OA</SRCOUTSYSTEMCODE>
    <SRCBATCHNO>mars_20210420002</SRCBATCHNO>
    <TRANSCODE>AMSQ01</TRANSCODE>
    <TRANSDATETIME>2020-04-20 11:05:00</TRANSDATETIME>
    <MD5>123456</MD5>
  </pub>
  <req>
    <head>
      <ALLCOUNT>1</ALLCOUNT>
    </head>
    <list>
      <detail>
        <NOTECODE>ZJFK_001000_202104_00001014</NOTECODE>
        <MONEYWAY>1</MONEYWAY>
        <FINVOUCHERCODE>PZ1001</FINVOUCHERCODE>
      </detail>
    </list>
  </req>
</MBS>
         ]]>
</out:in0>
      </out:outSystemWS>
   </soapenv:Body>
</soapenv:Envelope>